# Characters:
define doomer = Character('Думер', color="#6655fa")


# Scenario:
label start:

    "Я снова здесь..."

    "Снова в этой бескрайней мгле..."

    "Снова рассуждаю о смысле своего жалкого бытия..."

    "В чём смысл нашей жизни?"

    "Мы рождаемся, хотя об этом никогда и не просили..."

    "Проживаем эту жизнь, плодим потомство, умираем."

    "И так каждый раз. Снова и снова. Поколение за поколением."

    "Бесконечный бессмысленный цикл."

    "...или смысл в этом цикле всё-таки есть?"

    play sound "phone_alarm.mp3"

    pause 5

    scene bg ceiling_1
    with Dissolve(.5)
    pause 1

    doomer "Ещё... 5 минуточек..."

    # replace with empty black background
    scene
    with Dissolve(2)

    stop sound fadeout 3
    pause 3.3

    "А для чего жили наши родители?"

    "Вот допустим, мой отец всю жизнь проработал на заводе за копейки. Каждый рабочий день он вставал в 6 часов утра, громко гремел чашками на кухне и кипятил чайник."

    "Каждое утро он начинал с омлета, попутно слушая неизвестное мне радио, где обсуждали всё на свете, но только не полезные вещи."

    "А кто-то сейчас вообще радио слушает?"

    "Отец начинал каждое утро именно так. Отличий практически не было. Уверен, что на работе всё было по той же тенденции."

    "Это же настоящий День Сурка!"

    "Какой смысл в повторении одного и того же действия? День за днём, год за годом."

    "Хотя, чем я отличаюсь от него?"

    play sound "phone_alarm.mp3"

    pause 5

    scene bg ceiling_1
    with Dissolve(.5)
    pause 1

    "Вставать мне совершенно не хотелось. Однако выбора у меня не было. Работа не ждёт. Нужно платить за квартиру и хоть чем-то питаться до следующей выплаты."

    stop sound

    "Иронично."

    return
